Repository: apluslms/mooc-jutut
Catalog: feedback/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Not a valid regex pattern
fi: Ei säännöllinen lauseke

source: Oldest first
fi: Vanhemmat ensin

source: Newest first
fi: Uudemmat ensin

source: Exercise order
fi: Tehtäväjärjestys

source: Reverse exercise order
fi: Käänteinen tehtäväjärjestys

source: Flags
fi: Liput

source: Feedback tags
fi: Palautetägit

source: Student tags
fi: Opiskelijatägit

source: Timestamp
fi: Aikaleima

source: Exercise identifier
fi: Tehtävän tunniste

source: Filter based on the exercise path key (typically of the format 'modulekey_chapterkey_exercisekey'). The filter uses case-insensitive regular expression match.
fi: Suodata tehtävän polkutunnisteen perusteella. (Tunniste on tyypillisesti muodossa 'moduulintunniste_luvuntunniste_tehtäväntunniste'). Suodatin tarkistaa vastaako tunniste aakkoskoosta riippumatta säännöllistä lauseketta (case-insensitive regex).

source: Student content
fi: Opiskelijan sisältö

source: Filter conversations based on content of the student feedback responses. Unfortunately this includes the field names as well as non-textual responses. The operators 'AND', 'OR' and 'NOT' (case-sensitive) are supported. Otherwise the search is case-insensitive.
fi: Suodata keskusteluita opiskelijoiden palautteen sisällön perusteella. Valitettavasti tämä sisältää myös palautekenttien nimet sekä muutkin vastaukset kirjallisten vastausten lisäksi. Haku tukee operaattoreiden 'AND', 'OR' ja 'NOT' käyttöä. (Operaattorit ovat aakkoskoosta riippuvia, mutta muutoin haku on aakkoskoosta riippumaton.)

source: Use regex search
fi: Käytä regex-hakua

source: Override default search method and use case-insensitive regex search instead.
fi: Etsi tavallisen hakumenetelmän sijaan säännöllisellä lausekkeella (case-insensitive regex).

source: Teacher content
fi: Opettajan vastaus

source: Filter conversations based on text in the teacher responses. The operators 'AND', 'OR' and 'NOT' (case-sensitive) are supported. Otherwise the search is case-insensitive.
fi: Suodata keskusteluita opettajien vastauksissa esiintyvän tekstin palautteen sisällön perusteella. Haku tukee operaattoreiden 'AND', 'OR' ja 'NOT' käyttöä. (Operaattorit ovat aakkoskoosta riippuvia, mutta muutoin haku on aakkoskoosta riippumaton.)

source: Display only feedback with text content
fi: Näytä ainoastaan palautteet, joissa on tekstisisältöä

source: Filter out automatically graded feedback. Display only responses that contain text responses as well as feedback that a teacher has responded to.
fi: Jätä pois automaattisesti arvostellut palautteet. Näytä ainoastaan palautteet, joissa opiskelija on vastannut kirjallisesti, sekä palautteet, joihin opettaja on vastannut.

source: Sort
fi: Järjestä

source: older versions
fi: vanhemmista versioista

source: Someone else has updated this form. See {older_versions_link} for editing.
fi: Joku muu on päivittänyt lomaketta. Katso {older_versions_link} mikä on muuttunut.

source: Source course
fi: Valitse kurssi

source: Read
fi: Luettu

source: Both
fi: Molemmat

source: Unread
fi: Lukematon

source: Graded
fi: Arvosteltu

source: Ungraded
fi: Ei arvosteltu

source: Manually graded
fi: Käsin arvosteltu

source: Automatically graded
fi: Automaattisesti arvosteltu

source: Responded
fi: Vastattu

source: Unresponded
fi: Vastaamaton

source: Upload has error
fi: Lähetys on epäonnistunut

source: Upload ok
fi: Lähetys on onnistunut

source: Exercise
fi: Tehtävä

source: Student
fi: Opiskelija

source: No response
fi: Ei vastausta

source: Rejected
fi: Hylätty

source: Accepted
fi: Hyväksytty

source: Good
fi: Hyvä

source: No notification
fi: Ei ilmoitusta

source: Normal notification
fi: Normaali ilmoitus

source: Important notification
fi: Tärkeä ilmoitus

source: Response time
fi: Vastausaika

source: Responder
fi: Vastaaja

source: Response message
fi: Vastausviesti

source: Response grade
fi: Arvosana

source: Response notify
fi: Ilmoitus vastauksesta

source: Response seen
fi: Vastaus nähty

source: Pin
fi: Kiinnitä

source: Pin tag to the beginning of the list of tags.
fi: Kiinnitä tägi luettelon alkuun.

source: Question key
fi: Kysymyksen avain

source: Response value
fi: Vastausvaihtoehto

source: Indicate for which response values this tag should be displayed. This can be a regex pattern.
fi: Mitä vastausvaihtoehtoja tämä tägi kuvastaa. Tämä voi olla säännöllinen lauseke.

source: Color
fi: Väri

source: Color that is used as background for this tag
fi: Tägin taustaväri

source: Content
fi: Sisältö

source: Content which is displayed in the tag. The response value can be included by writing '{}' where the value is desired. However, it is recommended to display the value only if it is known to be short, e.g. timespent.
fi: Sisältö, joka näkyy tägissä. Vastaus itse voidaan esittää tägissä laittamalla '{}' kohtaan, johon se halutaan. Kuitenkin, vastausta ei kannata näyttää tägissä ellei sen tiedetä olevan lyhyt, kuten käytetyn ajan arvio.

source: No feedback yet.
fi: Ei palautetta.

source: Add
fi: Lisää

source: Save
fi: Tallenna

source: Cancel
fi: Peruuta

source: Confirm feedback tag removal
fi: Vahvista palautetägin poisto

source: Are you sure you want to remove the context tag %(tag)s from course %(course)s?
fi: Oletko varma, että haluat poistaa kontekstitägin %(tag)s kurssilta %(course)s?

source: Confirm
fi: Vahvista

source: List of context tags
fi: Luettelo kontekstitägeistä

source: Context tag
fi: Kontekstitägi

source: Actions
fi: Toiminnot

source: edit
fi: muokkaa

source: remove
fi: poista

source: Import feedback tags from another course
fi: Tuo palautetägit toiselta kurssilta

source: Import
fi: Tuo

source: Tags to be imported
fi: Tuotavat tägit

source: Feedback tag
fi: Palautetägi

source: Slug
fi: Tunniste

source: Description
fi: Kuvaus

source: Can be imported
fi: Tuonti mahdollista

source: yes
fi: kyllä

source: no (tag with this slug already exists)
fi: ei (tunnisteella on jo tägi)

source: No feedback tags found for this course.
fi: Kurssille ei löytynyt palautetägejä.

source: Are you sure you want to remove feedback tag %(tag)s from course %(course)s? This tag will be removed from all conversations it was associated with.
fi: Oletko varma, että haluat poistaa palautetägin %(tag)s kurssilta %(course)s?Tämä tägi poistetaan kaikista keskusteluista, joihin se oli tägätty.

source: List of feedback tags
fi: Luettelo palautetägeistä

source: Unable to fetch student's response.
fi: Opiskelijan vastauksen hakeminen ei onnistunut.

source: No feedback shown as there are errors in the filter form
fi: Palautteita ei näytetä, sillä lomakkeessa on virhe

source: No feedback shown as there is no filter selection
fi: Palautteita ei näytetä, sillä mitään rajoitteita ei ole valittu

source: No feedback found
fi: Yhtään palautetta ei löytynyt

source: No unread feedback.
fi: Ei lukemattomia palautteita

source: Show exercise in A+
fi: Näytä tehtävä A+:ssa

source: Show all feedback for this exercise
fi: Näytä kaikki palautteet tähän tehtävään

source: Copy link to this conversation
fi: Kopioi linkki tähän keskusteluun

source: The link was copied to the clipboard
fi: Linkki kopioitiin leikepöydälle

source: This field was <b>not</b> required
fi: Tämä kenttä <b>ei</b> ollut pakollinen

source: optional
fi: valinnainen

source: Show all feedback fields
fi: Näytä kaikki palautekentät

source: Show submission in A+
fi: Näytä palautus A+:ssa

source: Filter options (%(number)s active)
fi: Rajausvalinnat (%(number)s aktiivista)

source: Total
fi: Kokonaispisteet

source: Points in category '%(category_name)s'
fi: '%(category_name)s'-kategorian pisteet

source: Points from module
fi: Pisteet moduulista

source: Points to pass
fi: Läpäisyyn vaadittavat pisteet

source: The student has not passed the module.
fi: Opiskelija ei ole läpäissyt moduulia.

source: Points from chapter
fi: Pisteet luvusta

source: The student has not passed all of the exercises in the chapter.
fi: Opiskelija ei ole läpäissyt kaikkia luvun tehtäviä.

source: Points
fi: Pisteet

source: Update
fi: Päivitä

source: Respond
fi: Vastaa

source: Toggle text preview
fi: Tekstin esikatselun vaihtaminen

source: Preview
fi: Esikatsele

source: Hide preview
fi: Piilota esikatselu

source: Hide preview and return to editing
fi: Piilota esikatselu ja palaa muokkausnäkymään

source: Show styling buttons
fi: Näytä muotoilupainikkeet

source: Styling buttons
fi: Muotoilupainikkeet

source: Insert link
fi: Lisää linkki

source: Bold
fi: Lihavointi

source: Italic
fi: Kursivointi

source: Monospace/code
fi: Tasalevyinen/koodi

source: Conflict
fi: Ristiriita

source: not saved
fi: tallentamaton

source: This feedback was automatically accepted
fi: Palaute on automaattisesti hyväksytty

source: The student has seen this response.
fi: Opiskelija on nähnyt tämän vastauksen.

source: Open student page in A+
fi: Avaa opiskelijasivu A+:ssa

source: Toolbar of buttons related to student
fi: Kokoelma opiskelijaan liittyviä painikkeita

source: Group of buttons for viewing conversations with student
fi: Ryhmä painikkeita, joiden avulla voi tarkastella keskusteluita opiskelijan kanssa

source: Show all feedback for this student
fi: Näytä kaikki palautteet tältä opiskelijalta

source: Conversations with %(name)s
fi: Keskustelut opiskelijan %(name)s kanssa

source: Unable to preview conversations.
fi: Keskustelujen esikatselu ei onnistu.

source: Show conversations with student in a popover.
fi: Näytä keskustelut opiskelijan kanssa popover-ikkunassa.

source: Group of buttons providing background context
fi: Ryhmä painikkeita, jotka tarjoavat taustakontekstia

source: Background questionnaire for %(name)s
fi: Opiskelijan %(name)s vastaus taustatietokyselyyn

source: Show the student's response to the background questionnaire in a popover.
fi: Näytä opiskelijan vastaus taustatietokyselyyn popover-ikkunassa.

source: Background
fi: Taustatieto

source: Points for %(name)s
fi: Opiskelijan %(name)s pisteet

source: Unable to fetch points.
fi: Pisteiden hakeminen ei onnistunut.

source: Show the student's points in a popover.
fi: Näytä opiskelijan pisteet popover-ikkunassa.

source: Upload is <b>not</b> ok.<br>Tried %(count)s times.<br>Last tried %(when)s with status %(code)s.
fi: Lähetyksessä on <b>virhe</b>.<br>Lähettämistä yritetty %(count)s kertaa.<br>Viimeisin yritys %(when)s sai vastauskoodin %(code)s.

source: upload status %(code)s
fi: lähetyksen tila %(code)s

source: Uploading
fi: Lähettää

source: Management
fi: Hallinta

source: Site: %(name)s
fi: Sivusto: %(name)s

source: Select site
fi: Valitse sivusto

source: Select course
fi: Valitse kurssi

source: Show unresponded feedback for %(name)s
fi: Näytä vastaamattomat palautteet kurssille %(name)s

source: More
fi: Lisää

source: Filter feedback
fi: Rajaa palautteita

source: Manage feedback tags
fi: Hallitse palautetägejä

source: Import feedback tags
fi: Tuo palautetägejä

source: Manage context tags
fi: Hallitse kontekstitägejä

source: Student list
fi: Opiskelijalista

source: Time usage
fi: Ajankäyttö

source: Update Student tags
fi: Päivitä opiskelijatägit

source: Clear cache
fi: Tyhjennä välimuisti

source: Service status
fi: Palvelun tila

source: Language
fi: Kieli

source: List of courses with feedback
fi: Luettelo palautteellisista kursseista

source: see all not responded
fi: Vastaamattomat

source: No courses known yet.
fi: Ei tunnettuja kursseja.

source: Feedback for %(course)s
fi: Palautteet kurssilla '%(course)s'

source: Unread Feedback
fi: Lukemattomat palautteet

source: Fewer options
fi: Vähemmän valintoja

source: More options
fi: Lisää valintoja

source: Filter
fi: Suodata

source: List of known sites in feedback management
fi: Luettelo tunnetuista sivustoista palautteenhallinnassa

source: see courses and exercises
fi: Kurssit ja tehtävät

source: No known sites yet.
fi: Ei tunnettuja sivuja.

source: Update student tags
fi: Päivitä opiskelijatägit

source: The most recent update of students tags for this course was on <b>%(time)s</b> (%(naturaltime)s).
fi: Tämän kurssin opiskelijatägit on päivitetty viimeksi <b>%(time)s</b> (%(naturaltime)s).

source: Update tags now
fi: Päivitä tägit nyt

source: New tags
fi: Uudet tägit

source: Updated tags
fi: Päivitetyt tägit

source: Deleted tags
fi: Poistetut tägit

source: This user is not authenticated using LTI and doesn't have api token.
fi: Käyttäjä ei ole kirjautunut LTI:n kautta, joten sillä ei ole api avainta.

source: List of students with feedback
fi: Luettelo opiskelijoista, joilla on palautetta

source: No feedback by any student yet.
fi: Ei palautetta keneltäkään.

source: teacher
fi: opettaja

source: Previous responses and teacher replies
fi: Aiemmat omat vastaukset ja opettajan vastaukset

source: Previous responses
fi: Aiemmat omat vastaukset

source: show more
fi: näytä lisää

source: This feedback has unsaved changes!
fi: Palautteessa on tallentamattomia muutoksia!

source: Submit
fi: Lähetä

source: Reset changes
fi: Peru muutokset

source: Feedback
fi: Palaute

source: Feedback <i>%(jutut)s</i> for <i>%(aplus)s</i>
fi: Palaute <i>%(jutut)s</i> palvelulle <i>%(aplus)s</i>

source: Give 0 points and send response
fi: Anna 0 pistettä ja lähetä vastaus

source: Give half points and send response
fi: Anna puolet pisteistä ja lähetä vastaus

source: Give full points and send response
fi: Anna täydet pisteet ja lähetä vastaus

source: Grade and send response
fi: Arvioi ja lähetä vastaus

source: Missing A+ API token!
fi: A+ API-avain puuttuu!

source: Some features will not fully work due to the missing A+ API token. Log in via A+ and access this site through the course menu.
fi: Jotkin sivun toiminnot eivät toimi täysin puuttuvan A+ API-avaimen takia. Kirjaudu sisään A+-palvelussa ja tule tälle sivustolle kurssivalikon kautta.

source: Unable to fetch content due to missing A+ API token. Log in via A+ and access this site through the course menu.
fi: Sisällön hakeminen ei onnistu puuttuvan A+ API-avaimen takia. Kirjaudu sisään A+-palvelussa ja tule tälle sivustolle kurssivalikon kautta.

source: Edit feedback tag
fi: Muokkaa palautetägiä

source: Add new feedback tag
fi: Lisää uusi palautetägi

source: Imported successfully tags: {imported_tags}.
fi: Tuotiin onnistuneesti tägit: {imported_tags}.

source: No tags were imported.
fi: Tuotiin 0 tägiä.

source: Edit context tag
fi: Muokkaa kontekstitägiä

source: Add new context tag
fi: Lisää uusi kontekstitägi
