Repository: apluslms/mooc-jutut
Catalog: core/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Service status
fi: Palvelun tila

source: Frontpage
fi: Etusivu

source: An interactive course feedback and response tool
fi: Interaktiivinen kurssipalaute ja vastaus-työkalu

source: View the Github project
fi: Katso Github-projekti

source: Welcome to your institution's Jutut installation.
fi: Tervetuloa instituutiosi Jutut-asennukseen.

source: Point your A+ exercises with form specs to <code>%(site)sfeedback/[course_tag]/[exercise_name]</code> and Jutut will do the rest.
fi: Osoita lomakekuvauksen sisältävät A+ tehtävät osoitteeseen <code>%(site)sfeedback/[course_tag]/[exercise_name]</code> ja Jutut hoitaa puolestasi loput.

source: To browse and respond feedbacks, login using LTI and you will be forwarded to a correct page.
fi: Selataksesi palautteita sinun tulee kirjautua sisään LTI:llä. Kirjautumisen yhteydessä sinut ohjataan oikealle sivulle.

source: You may use <code>./manage.py add_lti_key</code> to configure LTI keys for the login.
fi: Voit lisätä LTI avaimia komennolla <code>./manage.py add_lti_key</code>. Huomaa myös muut LTI komennot.

source: Enter the management site
fi: Siirry hallintasivustolle

source: View status of services
fi: Katso palveluiden tila
